package sgtmelon.scriptum

import sgtmelon.scriptum.app.screen.intro.IntroActivity
import sgtmelon.scriptum.app.screen.main.MainActivity
import sgtmelon.scriptum.app.screen.main.notes.NotesFragment
import sgtmelon.scriptum.office.utils.Preference

/**
 * Описание сценариев для тестов
 */
class Scenario {

    /**
     * [IntroActivity]
     */
    class Intro {

        /**
         * Проверка запуска, в записимости от ключа [Preference.firstStart]
         */

        /**
         * Проверка правильности отображения контента на страницах
         */

        /**
         * Проверка доступа к кнопке завершения
         */

        /**
         * Проверка работы кнопки завершения
         */

    }

    /**
     * [MainActivity]
     */
    class Main {

        /**
         * Проверка навигации
         */

        /**
         * Проверка правильности стартого фрагмента
         */

        /**
         * Проверка правильного расположения фрагментов и отображения Fab
         */

        /**
         * Проверка открытия диалога для добавления заметки
         */

        /**
         * Проверка выбора в диалоге добавления заметки - текста
         */

        /**
         * Проверка выбора в диалоге добавления заметки - списка
         */

        /**
         * Проверка скроллинга страниц до верха
         */

    }

    class Rank

    /**
     * [NotesFragment]
     */
    class Notes {

        /**
         * Проверка открытия настроек
         */

        /**
         * Скроллинг списка до конца и обратно
         */

        /**
         * Проверка открытия заметки - текст / список
         */

        /**
         * Проверка появления заметки в списке после её создания - текста / список
         */

        /**
         * Проверка открытия диалога управления заметкой - текст/ список
         */

        /**
         * TODO - Проверка отметки пунктов - список
         */

        /**
         * TODO - Проверка биндинга в статус бар - текст / список
         */

        /**
         * TODO - Проверка конвертирования заметки - текст / список
         */

        /**
         * TODO - Проверка копирования текста - текст / список
         */

        /**
         * TODO - Проверка удаления заметки - текст / список
         */

        /**
         * TODO - Проверка сохранения списка при смене ориентации
         */

        /**
         * TODO - Проверка сохранения диалога управления заметкой при смене ориентации
         */

    }

    /**
     * [BinFragment]
     */
    class Bin {

        /**
         * Скроллинг списка до конца и обратно
         */

        /**
         * Проверка открытия заметки - текст / список
         */

        /**
         * Проверка работы диалога отчистки корзины
         */

        /**
         * Проверка открытия диалога управления заметкой - текст / список
         */

        /**
         * Проверка восстановления заметки - текст / список
         */

        /**
         * Проверка копирования текста - текст / список
         */

        /**
         * Проверка удаления заметки - текст / список
         */

        /**
         * TODO - Проверка сохранения списка при смене ориентации
         */

        /**
         * TODO - Проверка сохранения диалога отчистки корзины при смене ориентации
         */

        /**
         * TODO - Проверка сохранения диалога управления заметкой при смене ориентации
         */

    }

}