package sgtmelon.scriptum

import sgtmelon.scriptum.office.utils.Preference
import sgtmelon.scriptum.test.IntroTest
import sgtmelon.scriptum.test.SplashTest
import sgtmelon.scriptum.test.main.BinTest
import sgtmelon.scriptum.test.main.MainTest
import sgtmelon.scriptum.test.main.NotesTest
import sgtmelon.scriptum.test.main.RankTest

/**
 * Описание сценариев для тестов
 *
 * @author SerjantArbuz
 */
class Scenario {

    // TODO сценарии из книги (поворот экрана и прочее)

    /**
     * Сценарии для [SplashTest]
     */
    class Splash {

        /**
         * 1. Проверка запуска, в записимости от ключа [Preference.firstStart]
         */

        /**
         * 2. Проверка открытия заметки из уведомления - текст / список
         */

    }

    /**
     * Сценарии для [IntroTest]
     */
    class Intro {

        /**
         * 1. Проверка правильности отображения контента на страницах
         */

        /**
         * 2. Проверка доступа к кнопке завершения
         */

        /**
         * 3. Проверка работы кнопки завершения
         */

    }

    /**
     * Сценарии для [MainTest]
     */
    class Main {

        /**
         * 1. Проверка навигации
         */

        /**
         * 2. Проверка правильности стартого фрагмента
         */

        /**
         * 3. Проверка правильного расположения фрагментов и отображения Fab
         */

        /**
         * 4. Проверка открытия диалога для добавления заметки
         */

        /**
         * 5. Проверка выбора в диалоге добавления заметки - текста
         */

        /**
         * 6. Проверка выбора в диалоге добавления заметки - списка
         */

        /**
         * 7. Проверка скроллинга страниц до верха
         */

    }

    /**
     * Сценарии для [RankTest]
     */
    class Rank

    /**
     * Сценарии для [NotesTest]
     */
    class Notes {

        /**
         * 1. Проверка контента
         **/

        /**
         * 2. Проверка открытия настроек
         */

        /**
         * 3. Скроллинг списка до конца и обратно
         */

        /**
         * 4. Проверка открытия заметки - текст / список
         */

        /**
         * 5. Проверка появления заметки в списке после её создания - текста / список
         */

        /**
         * 6. Проверка открытия диалога управления заметкой - текст/ список
         */

        /**
         * 7. TODO - Проверка отметки пунктов - список
         */

        /**
         * 8. TODO - Проверка биндинга в статус бар - текст / список
         */

        /**
         * 9. Проверка конвертирования заметки - текст / список
         */

        /**
         * 10. TODO - Проверка копирования текста - текст / список
         */

        /**
         * 11. Проверка удаления заметки - текст / список
         */

    }

    /**
     * Сценарии для [BinTest]
     */
    class Bin {

        /**
         * 1. Проверка контента
         */

        /**
         * 2. Скроллинг списка до конца и обратно
         */

        /**
         * 3. Проверка открытия заметки - текст / список
         */

        /**
         * 4. Проверка работы диалога отчистки корзины
         */

        /**
         * 5. Проверка открытия диалога управления заметкой - текст / список
         */

        /**
         * 6. Проверка восстановления заметки - текст / список
         */

        /**
         * 7. Проверка копирования текста - текст / список
         */

        /**
         * 8. Проверка удаления заметки - текст / список
         */

    }

}