package sgtmelon.scriptum

import sgtmelon.scriptum.app.screen.intro.IntroActivity
import sgtmelon.scriptum.app.screen.main.MainActivity
import sgtmelon.scriptum.app.screen.main.notes.NotesFragment
import sgtmelon.scriptum.office.utils.PrefUtils

/**
 * Описание сценариев для тестов
 */
class Scenario {

    /**
     * [IntroActivity]
     */
    class Intro {

        /**
         * Проверка запуска, в записимости от ключа [PrefUtils.firstStart]
         */

        /**
         * Проверка правильности отображения контента на страницах
         */

        /**
         * Проверка доступа к кнопке завершения
         */

        /**
         * Проверка работы кнопки завершения
         */

    }

    /**
     * [MainActivity]
     */
    class Main {

        /**
         * Проверка навигации
         */

        /**
         * Проверка правильности стартого фрагмента
         */

        /**
         * Проверка правильного расположения фрагментов и отображения Fab
         */

        /**
         * Проверка открытия диалога для добавления заметки
         */

        /**
         * Проверка выбора в диалоге добавления заметки - текста
         */

        /**
         * Проверка выбора в диалоге добавления заметки - списка
         */

    }

    class Rank

    /**
     * [NotesFragment]
     */
    class Notes {

        /**
         * Проверка открытия настроек
         */

        /**
         * Проверка появления заметки в списке после её создания - текста
         */

        /**
         * Проверка появления заметки в списке после её создания - списка
         */

        /**
         * Проверка открытия диалога управления заметкой - текст
         */

        /**
         * Проверка открытия диалога управления заметкой - список
         */

        /**
         * TODO - Проверка работы диалога
         */

    }

    class Bin

}